In [28]:
import pandas as pd

# 문제1. user_id를 인덱스로 사용하여 occupation.tsv 데이터프레임 읽기

In [29]:
df = pd.read_csv("./data/occupation.tsv", sep="|",  index_col="user_id")

df.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [30]:
df.shape

(943, 4)

# 문제2. 각 occupation별 age의 평균 구하기

In [31]:
groups = df.groupby("occupation") # 머리가 안돌아가면 직접 쓰세요

In [32]:
groups

In [33]:
# for key, group in groups:
#     print("keys : ", key)
#     print("group : ", group)

In [34]:
age_avg = groups[["age"]].mean()

In [35]:
age_avg

                     age
occupation
administrator  38.746835
artist         31.392857
doctor         43.571429
educator       42.010526
engineer       36.388060
entertainment  29.222222
executive      38.718750
healthcare     41.562500
homemaker      32.571429
lawyer         36.750000
librarian      40.000000
marketing      37.615385
none           26.555556
other          34.523810
programmer     33.121212
retired        63.071429
salesman       35.666667
scientist      35.548387
student        22.081633
technician     33.148148
writer         36.311111

# 문제3. 각 occupation 별 남자의 비율 구하기
- 단, 남자 비율의 내림차순으로 정렬하여 출력하기

In [36]:
groups[["gender"]]

In [37]:
df.shape[0]

943

In [38]:
# 비율구하기
# (남자/ 사람) * 100 이렇게 해버릴까?

# 조건을 사용해서 남자의 비율을 구해보자 
len(df[df["gender"] == "M"])

670

In [39]:
#groups[["gender"]].describe()

# 그룹 각각의 개수

occupation = df.groupby(["occupation"])

In [40]:
#groups[["gender"]].describe()

gg = df.groupby(["occupation"])["gender"]

In [41]:
# for i, g in gg:
#     print(i)
#     print(g.count())
man = df[df["gender"] == "M"]

man_length = man.groupby("occupation")["gender"].count()

oh_result = man_length / groups["gender"].count()

oh_result.sort_values(ascending= False)

occupation
doctor           1.000000
engineer         0.970149
technician       0.962963
retired          0.928571
programmer       0.909091
executive        0.906250
scientist        0.903226
entertainment    0.888889
lawyer           0.833333
salesman         0.750000
educator         0.726316
student          0.693878
other            0.657143
marketing        0.615385
writer           0.577778
none             0.555556
administrator    0.544304
artist           0.535714
librarian        0.431373
healthcare       0.312500
homemaker        0.142857
Name: gender, dtype: float64

# 문제4. occupation별 age의 최솟값, 최댓값 구하기

In [43]:
age_min_max = groups[["age"]].agg(["min", "max"])
age_min_max

              age
              min max
occupation
administrator  21  70
artist         19  48
doctor         28  64
educator       23  63
engineer       22  70
entertainment  15  50
executive      22  69
healthcare     22  62
homemaker      20  50
lawyer         21  53
librarian      23  69
marketing      24  55
none           11  55
other          13  64
programmer     20  63
retired        51  73
salesman       18  66
scientist      23  55
student         7  42
technician     21  55
writer         18  60

# 문제5. 각 occupation의 gender별 평균 age를 구하기

In [ ]:
# occupation 이라는 컬럼??

In [ ]:
df

In [ ]:

groups_2 = df.groupby(["occupation", "gender"], observed = True)

for key, group in groups_2:
    print("keys : ", key)
    print("group : ", group)

In [ ]:
groups_2[["age"]].mean()

In [47]:
# 람다로 풀어보기


# 평균값을 구하면 자연스럽게.... 비율이 나온다니... 우왓
# lambda_result_group = groups.apply(lambda x :  sum(x["gender"]  == "M") / len(x["gender"])).sort_values( ascending = False)

lambda_result_group = groups["gender"].apply(lambda x : ( x  == "M").mean()).sort_values( ascending = False)
lambda_result_group

occupation
doctor           1.000000
engineer         0.970149
technician       0.962963
retired          0.928571
programmer       0.909091
executive        0.906250
scientist        0.903226
entertainment    0.888889
lawyer           0.833333
salesman         0.750000
educator         0.726316
student          0.693878
other            0.657143
marketing        0.615385
writer           0.577778
none             0.555556
administrator    0.544304
artist           0.535714
librarian        0.431373
healthcare       0.312500
homemaker        0.142857
Name: gender, dtype: float64